read_liberty -lib sky130.lib
read_verilog alu_8bit.v
hierarchy -check -top alu_8bit
proc
opt
techmap
opt
abc -liberty sky130.lib
opt_clean
write_verilog -noattr netlist_timing.v
stat -liberty sky130.lib
