read_verilog alu_8bit.v
hierarchy -check -top alu_8bit
proc
opt
techmap
opt
abc -g AND,OR,XOR
opt_clean
write_verilog -noattr netlist.v
stat
